tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "borkdude/brew"
tap "clojure-lsp/brew"

# Brews are libraries and commandline interfaces
# Often brews are bottled, meaning installation is just about
# downloading to a location that's on your PATH
brew "aspell"
brew "autoconf"
brew "automake"
brew "babashka"
brew "bat"
brew "burl"
brew "ccls"
brew "clang-format"
brew "clj-kondo"
brew "clojure"
brew "ditaa"
brew "exa"
brew "exiftool"
brew "fzf"
brew "git"
brew "git-fresh"
brew "git-extras"
brew "gitleaks"
brew "grc"
brew "hr"
brew "htop"
brew "hub"
brew "ispell"
brew "mas"
brew "nmap"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sloc"
brew "starship"
brew "tmux"
brew "topgrade"
brew "trash"
brew "wtf"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zydis"

# Casks are executables that can not be found in the Appstore
# There are also some resources like fonts available as Casks
cask "android-studio"
cask "imageoptim"
cask "slack"

# With Mas we can download applications from the Appstore from the
# commandline
mas "Final Cut Pro", id: 424389933
mas "Pixelmator Pro", id: 1289583905
mas "Moom", id: 419330170
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Xcode", id: 497799835
mas "Gestimer", id: 990588172
