tap "homebrew/cask"
tap "borkdude/brew"



# Brews are libraries and commandline interfaces.
# Often brews are bottled, meaning installation is just about
# downloading to a location that's on your ~PATH~.

brew "autoconf"
brew "automake"
brew "bat"
brew "exa"
brew "fzf"
brew "git"
brew "git-fresh"
brew "git-extras"
brew "gitleaks"
brew "grc"
brew "hr"
brew "htop"
brew "hub"
brew "mas"
brew "nmap"
brew "sloc"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree"
brew "wtf"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zydis"



# Casks are executables that can not be found in the Appstore.
# There are also some resources like fonts available as Casks.

cask "imageoptim"
cask "numi"
cask "origami-studio"
cask "sketch"
cask "slack"
cask "sourcetrail"



# With using ~Mas~ we can download applications from the Appstore directly
# from the commandline.

mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Final Cut Pro", id: 424389933
mas "Gestimer", id: 990588172
mas "Moom", id: 419330170
mas "Pixelmator Pro", id: 1289583905
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
